Revit 2024 API
Family.GetFamilySymbolIds Method
 Gets the ids of the FamilySymbols owned by this Family.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ISet<ElementId> GetFamilySymbolIds()
Visual Basic
Public Function GetFamilySymbolIds As ISet(Of ElementId)
Visual C++
public:
ISet<ElementId^>^ GetFamilySymbolIds()
Return Value
 The ids of the FamilySymbols.
See Also
Family Class
Autodesk.Revit.DB Namespace